package org.example.HW_1.Task4;

public class Ex {
}

/*
Система Управления Транспортным Парком
Классы:
Автомобиль (Car)
Поля: марка, модель, год выпуска.
Методы: вывод информации об автомобиле, проверка на техосмотр.


Водитель (Driver)
Поля: имя, стаж вождения, текущий автомобиль (Car).
Методы: назначить автомобиль, освободить автомобиль.


Менеджер Парка (FleetManager)
Поля: имя, список автомобилей (массив), список водителей (массив).
Методы: добавить автомобиль в парк, назначить автомобиль водителю.


Транспортный Парк (Fleet)
Поля: название, адрес, список менеджеров парка (массив).
Методы: добавить менеджера, поиск менеджера по имени.
 */